interface Feature {
  title: string;
  labels: string[];
}

interface Slide {
  title: string;
  href: string;
  descriptions: string[];
  features: Feature[];
  images: string[];
}

export interface Data {
  slides: Slide[];
}

export const DATA: Data = {
  slides: [
    {
      title: "RK 9000",
      href: "#RK9000",
      descriptions: [
        "Обновленный клапан выдоха для легкого дыхания",
        "Анатомическая форма носовой части фильтрующей полумаски дополнена гибкой пластиной для адаптации к особенностям лица",
      ],
      features: [
        {
          title: "Защита от всех видов аэрозолей",
          labels: ["Пыль", "Дым", "Туман"],
        },
        {
          title: "Дополнительная защита",
          labels: [
            "Органические газы и пары от нагрева металлов",
            "Сварочные аэрозоли, озон",
            "Кислые газы",
            "Неорганические газы",
          ],
        },
      ],
      images: [
        "assets/images/series/0/0.jpeg",
        "assets/images/series/0/1.jpeg",
        "assets/images/series/0/2.jpeg",
        "assets/images/series/0/3.jpeg",
      ],
    },
    {
      title: "RK 9000",
      href: "#RK9000",
      descriptions: [
        "Обновленный клапан выдоха для легкого дыхания",
        "Анатомическая форма носовой части фильтрующей полумаски дополнена гибкой пластиной для адаптации к особенностям лица",
      ],
      features: [
        {
          title: "Защита от всех видов аэрозолей",
          labels: ["Пыль", "Дым", "Туман"],
        },
        {
          title: "Дополнительная защита",
          labels: [
            "Органические газы и пары от нагрева металлов",
            "Сварочные аэрозоли, озон",
            "Кислые газы",
            "Неорганические газы",
          ],
        },
      ],
      images: [
        "assets/images/series/1/0.jpeg",
        "assets/images/series/1/1.jpeg",
        "assets/images/series/1/2.jpeg",
        "assets/images/series/1/3.jpeg",
      ],
    },
    {
      title: "RK 9000",
      href: "#RK9000",
      descriptions: [
        "Обновленный клапан выдоха для легкого дыхания",
        "Анатомическая форма носовой части фильтрующей полумаски дополнена гибкой пластиной для адаптации к особенностям лица",
      ],
      features: [
        {
          title: "Защита от всех видов аэрозолей",
          labels: ["Пыль", "Дым", "Туман"],
        },
        {
          title: "Дополнительная защита",
          labels: [
            "Органические газы и пары от нагрева металлов",
            "Сварочные аэрозоли, озон",
            "Кислые газы",
            "Неорганические газы",
          ],
        },
      ],
      images: [
        "assets/images/series/2/0.jpeg",
        "assets/images/series/2/1.jpeg",
        "assets/images/series/2/2.jpeg",
        "assets/images/series/2/3.jpeg",
      ],
    },
    {
      title: "RK 9000",
      href: "#RK9000",
      descriptions: [
        "Обновленный клапан выдоха для легкого дыхания",
        "Анатомическая форма носовой части фильтрующей полумаски дополнена гибкой пластиной для адаптации к особенностям лица",
      ],
      features: [
        {
          title: "Защита от всех видов аэрозолей",
          labels: ["Пыль", "Дым", "Туман"],
        },
        {
          title: "Дополнительная защита",
          labels: [
            "Органические газы и пары от нагрева металлов",
            "Сварочные аэрозоли, озон",
            "Кислые газы",
            "Неорганические газы",
          ],
        },
      ],
      images: [
        "assets/images/series/3/0.jpeg",
        "assets/images/series/3/1.jpeg",
        "assets/images/series/3/2.jpeg",
        "assets/images/series/3/3.jpeg",
      ],
    },
    {
      title: "RK 9000",
      href: "#RK9000",
      descriptions: [
        "Обновленный клапан выдоха для легкого дыхания",
        "Анатомическая форма носовой части фильтрующей полумаски дополнена гибкой пластиной для адаптации к особенностям лица",
      ],
      features: [
        {
          title: "Защита от всех видов аэрозолей",
          labels: ["Пыль", "Дым", "Туман"],
        },
        {
          title: "Дополнительная защита",
          labels: [
            "Органические газы и пары от нагрева металлов",
            "Сварочные аэрозоли, озон",
            "Кислые газы",
            "Неорганические газы",
          ],
        },
      ],
      images: [
        "assets/images/series/4/0.jpeg",
        "assets/images/series/4/1.jpeg",
        "assets/images/series/4/2.jpeg",
        "assets/images/series/4/3.jpeg",
      ],
    },
    {
      title: "RK 9000",
      href: "#RK9000",
      descriptions: [
        "Обновленный клапан выдоха для легкого дыхания",
        "Анатомическая форма носовой части фильтрующей полумаски дополнена гибкой пластиной для адаптации к особенностям лица",
      ],
      features: [
        {
          title: "Защита от всех видов аэрозолей",
          labels: ["Пыль", "Дым", "Туман"],
        },
        {
          title: "Дополнительная защита",
          labels: [
            "Органические газы и пары от нагрева металлов",
            "Сварочные аэрозоли, озон",
            "Кислые газы",
            "Неорганические газы",
          ],
        },
      ],
      images: [
        "assets/images/series/5/0.jpeg",
        "assets/images/series/5/0.jpeg",
        "assets/images/series/5/0.jpeg",
        "assets/images/series/5/0.jpeg",
      ],
    },
  ],
};
